xml/siesa/connection.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CrearConexionXML xmlns="http://tempuri.org/">
        <pvstrxmlConexion>
                <NombreConexion>{{name}}</NombreConexion>
                <TipoBD>{{type}}</TipoBD>
                <NombreBD>{{db}}</NombreBD>
                <NombreServidorBD>{{host}}</NombreServidorBD>
                <UsuarioBD>{{user}}</UsuarioBD>
                <ClaveBD>{{password}}</ClaveBD>
                <NumConexionImpo>{{connection}}</NumConexionImpo>
        </pvstrxmlConexion>
    </CrearConexionXML>
  </soap:Body>
</soap:Envelope>